app/controllers/stumanagers_controller.rb

  def index
    @stumanagers = Stumanager.all
---
SELECT "stumanagers".* FROM "stumanagers"

  def create
    @stumanager = Stumanager.new(stumanager_params)

    respond_to do |format|
      if @stumanager.save
---
INSERT INTO "stumanagers" ("name", "deptname", "score", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Bob"], ["deptname", "Comp.sci"], ["score", 90], ["created_at", "2017-11-12 17:03:11.466626"], ["updated_at", "2017-11-12 17:03:11.466626"]]

  def update
    respond_to do |format|
      if @stumanager.update(stumanager_params)
---
UPDATE "stumanagers" SET "deptname" = ?, "updated_at" = ? WHERE "stumanagers"."id" = ?  [["deptname", "Finance"], ["updated_at", "2017-11-12 17:08:46.224790"], ["id", 1]]

  def destroy
    @stumanager.destroy
---
DELETE FROM "stumanagers" WHERE "stumanagers"."id" = ?  [["id", 5]]

    def set_stumanager
      @stumanager = Stumanager.find(params[:id])
---
SELECT  "stumanagers".* FROM "stumanagers" WHERE "stumanagers"."id" = ? LIMIT 1  [["id", 5]]